app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT `images`.* FROM `images`

  def create
    @image = Image.new(image_params)
    @image.save
---
INSERT INTO `images` (`image_id`, `title`, `comment`, `created_at`, `updated_at`, `place`) VALUES ('673f86670903673490d2a58243a2f33139dd0e7c45f0473541d155f70650', 'stock_at_hamamatsu', '2018_05', '2018-05-18 16:27:17', '2018-05-18 16:27:17', 'はままつフラワーパーク')

  def maps
    @images = Image.all
---
SELECT `images`.* FROM `images`

  def search
    @images = Image.all.pluck(:place)
---
SELECT `images`.`place` FROM `images`