app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `mail`, `password_digest`, `created_at`, `updated_at`) VALUES ('Akane', 'akane@gmail.com', '$2a$10$ePSVD7nsIMQzUIEstrbT7uP4C2/uwTiQGn5xsdV/7.L3AVeWmKwJm', '2018-05-18 16:26:07', '2018-05-18 16:26:07')