app/views/images/maps.slim

      a.uk-button href="#modal-full#{i}" uk-toggle=""
        = attachment_image_tag image, :image, :fill, 200, 200, format: 'png', class: "uk-card uk-card-default uk-card-body"
      .map.js-mapBase
      .uk-modal-full id ="modal-full#{i}" uk-modal=""
        .uk-modal-dialog
---
SELECT `images`.* FROM `images`